here is what I am getting now and yes I am on the same GCP project.

```
  # google_vpc_access_connector.connector will be created
  + resource "google_vpc_access_connector" "connector" {
      + id             = (known after apply)
      + ip_cidr_range  = "10.8.0.0/28"
      + max_throughput = 1000
      + min_throughput = 200
      + name           = "serverless-vpc-connector"
      + network        = "default"
      + project        = "aex-gaen-server-ph"
      + region         = "asia-east1"
      + self_link      = (known after apply)
      + state          = (known after apply)
    }

Plan: 23 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_vpc_access_connector.connector: Creating...

Error: Error creating Connector: googleapi: Error 409: Requested entity already exists

  on main.tf line 71, in resource "google_vpc_access_connector" "connector":
  71: resource "google_vpc_access_connector" "connector" {


Releasing state lock. This may take a few moments...

```

![Screenshot_326](https://user-images.githubusercontent.com/6380139/91777629-f748ad80-ec22-11ea-929b-806a0ee1eb04.png)
